VCVRack/Rack/plugins/community/repos/AudibleInstruments/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_can.c
  *** Flags ***
  =============
    [..]The 15 flags can be divided on 4 groups: 

        (+)Transmit Flags
           (##) CAN_FLAG_RQCP0, 
           (##) CAN_FLAG_RQCP1, 
           (##) CAN_FLAG_RQCP2  : Request completed MailBoxes 0, 1 and 2  Flags
                Set when when the last request (transmit or abort) has 
                been performed. 

        (+)Receive Flags
           (##) CAN_FLAG_FMP0,
           (##) CAN_FLAG_FMP1   : FIFO 0 and 1 Message Pending Flags 
                set to signal that messages are pending in the receive 
                FIFO.
                These Flags are cleared only by hardware. 
           (##) CAN_FLAG_FF0,
           (##) CAN_FLAG_FF1    : FIFO 0 and 1 Full Flags
                set when three messages are stored in the selected 
                FIFO.
           (##) CAN_FLAG_FOV0
           (##) CAN_FLAG_FOV1   : FIFO 0 and 1 Overrun Flags
                set when a new message has been received and passed 
                the filter while the FIFO was full.         

        (+)Operating Mode Flags
           (##) CAN_FLAG_WKU    : Wake up Flag
                set to signal that a SOF bit has been detected while 
                the CAN hardware was in Sleep mode. 
                
           (##) CAN_FLAG_SLAK   : Sleep acknowledge Flag
                Set to signal that the CAN has entered Sleep Mode. 
    
        (+)Error Flags
           (##) CAN_FLAG_EWG    : Error Warning Flag
                Set when the warning limit has been reached (Receive 
                Error Counter or Transmit Error Counter greater than 96). 
                This Flag is cleared only by hardware.
           (##) CAN_FLAG_EPV    : Error Passive Flag
                Set when the Error Passive limit has been reached 
                (Receive Error Counter or Transmit Error Counter 
                greater than 127).
                This Flag is cleared only by hardware.
           (##) CAN_FLAG_BOF    : Bus-Off Flag
                set when CAN enters the bus-off state. The bus-off 
                state is entered on TEC overflow, greater than 255.
                This Flag is cleared only by hardware.
           (##) CAN_FLAG_LEC    : Last error code Flag
                set If a message has been transferred (reception or
                transmission) with error, and the error code is hold.              
                
  *** Interrupts ***
  ==================
    [..]The 14 interrupts can be divided on 4 groups: 
  
        (+)Transmit interrupt
           (##) CAN_IT_TME   :  Transmit mailbox empty Interrupt
                if enabled, this interrupt source is pending when 
                no transmit request are pending for Tx mailboxes.      

        (+)Receive Interrupts
           (##) CAN_IT_FMP0,
           (##) CAN_IT_FMP1  :  FIFO 0 and FIFO1 message pending Interrupts
                if enabled, these interrupt sources are pending when 
                messages are pending in the receive FIFO.
                The corresponding interrupt pending bits are cleared 
                only by hardware.
           (##) CAN_IT_FF0,              
           (##) CAN_IT_FF1   :  FIFO 0 and FIFO1 full Interrupts
                if enabled, these interrupt sources are pending when
                three messages are stored in the selected FIFO.
           (##) CAN_IT_FOV0,        
           (##) CAN_IT_FOV1    :  FIFO 0 and FIFO1 overrun Interrupts        
                if enabled, these interrupt sources are pending when
                a new message has been received and passed the filter
                while the FIFO was full.

        (+)Operating Mode Interrupts
           (##) CAN_IT_WKU     :  Wake-up Interrupt
                if enabled, this interrupt source is pending when 
                a SOF bit has been detected while the CAN hardware was 
                in Sleep mode.
                                  
           (##) CAN_IT_SLK     :  Sleep acknowledge Interrupt
                if enabled, this interrupt source is pending when 
                the CAN has entered Sleep Mode.       

        (+)Error Interrupts 
           (##) CAN_IT_EWG     :  Error warning Interrupt 
                if enabled, this interrupt source is pending when
                the warning limit has been reached (Receive Error 
                Counter or Transmit Error Counter=96). 
                
           (##) CAN_IT_EPV     :  Error passive Interrupt        
                if enabled, this interrupt source is pending when
                the Error Passive limit has been reached (Receive 
                Error Counter or Transmit Error Counter>127).
                
           (##) CAN_IT_BOF     :  Bus-off Interrupt
                if enabled, this interrupt source is pending when
                CAN enters the bus-off state. The bus-off state is 
                entered on TEC overflow, greater than 255.
                This Flag is cleared only by hardware.
                
           (##) CAN_IT_LEC     :  Last error code Interrupt        
                if enabled, this interrupt source is pending  when
                a message has been transferred (reception or
                transmission) with error, and the error code is hold.
                
           (##) CAN_IT_ERR     :  Error Interrupt
                if enabled, this interrupt source is pending when 
                an error condition is pending.      

  *** Managing the CAN controller events ***
  ==========================================
    [..]The user should identify which mode will be used in his application to manage 
        the CAN controller events: Polling mode or Interrupt mode.
        (+)In the Polling Mode it is advised to use the following functions:
           (##) CAN_GetFlagStatus() : to check if flags events occur. 
           (##) CAN_ClearFlag()     : to clear the flags events.

        (+)In the Interrupt Mode it is advised to use the following functions:
           (##) CAN_ITConfig()       : to enable or disable the interrupt source.
           (##) CAN_GetITStatus()    : to check if Interrupt occurs.
           (##) CAN_ClearITPendingBit() : to clear the Interrupt pending Bit (corresponding Flag).
             -@@-This function has no impact on CAN_IT_FMP0 and CAN_IT_FMP1 Interrupts 
                 pending bits since there are cleared only by hardware. 
  
@endverbatim
  * @{
  */ 
/**
  * @brief  Enables or disables the specified CANx interrupts.
  * @param  CANx: where x can be 1 or 2 to to select the CAN peripheral.
  * @param  CAN_IT: specifies the CAN interrupt sources to be enabled or disabled.
  *          This parameter can be: 
  *            @arg CAN_IT_TME: Transmit mailbox empty Interrupt 
  *            @arg CAN_IT_FMP0: FIFO 0 message pending Interrupt 
  *            @arg CAN_IT_FF0: FIFO 0 full Interrupt
  *            @arg CAN_IT_FOV0: FIFO 0 overrun Interrupt
  *            @arg CAN_IT_FMP1: FIFO 1 message pending Interrupt 
  *            @arg CAN_IT_FF1: FIFO 1 full Interrupt
  *            @arg CAN_IT_FOV1: FIFO 1 overrun Interrupt
  *            @arg CAN_IT_WKU: Wake-up Interrupt
  *            @arg CAN_IT_SLK: Sleep acknowledge Interrupt  
  *            @arg CAN_IT_EWG: Error warning Interrupt
  *            @arg CAN_IT_EPV: Error passive Interrupt
  *            @arg CAN_IT_BOF: Bus-off Interrupt  
  *            @arg CAN_IT_LEC: Last error code Interrupt
  *            @arg CAN_IT_ERR: Error Interrupt
  * @param  NewState: new state of the CAN interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void CAN_ITConfig(CAN_TypeDef* CANx, uint32_t CAN_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_IT(CAN_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected CANx interrupt */
    CANx->IER |= CAN_IT;
  }
  else
  {
    /* Disable the selected CANx interrupt */
    CANx->IER &= ~CAN_IT;
  }
}
/**
  * @brief  Checks whether the specified CAN flag is set or not.
  * @param  CANx: where x can be 1 or 2 to to select the CAN peripheral.
  * @param  CAN_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg CAN_FLAG_RQCP0: Request MailBox0 Flag
  *            @arg CAN_FLAG_RQCP1: Request MailBox1 Flag
  *            @arg CAN_FLAG_RQCP2: Request MailBox2 Flag
  *            @arg CAN_FLAG_FMP0: FIFO 0 Message Pending Flag   
  *            @arg CAN_FLAG_FF0: FIFO 0 Full Flag       
  *            @arg CAN_FLAG_FOV0: FIFO 0 Overrun Flag 
  *            @arg CAN_FLAG_FMP1: FIFO 1 Message Pending Flag   
  *            @arg CAN_FLAG_FF1: FIFO 1 Full Flag        
  *            @arg CAN_FLAG_FOV1: FIFO 1 Overrun Flag     
  *            @arg CAN_FLAG_WKU: Wake up Flag
  *            @arg CAN_FLAG_SLAK: Sleep acknowledge Flag 
  *            @arg CAN_FLAG_EWG: Error Warning Flag
  *            @arg CAN_FLAG_EPV: Error Passive Flag  
  *            @arg CAN_FLAG_BOF: Bus-Off Flag    
  *            @arg CAN_FLAG_LEC: Last error code Flag      
  * @retval The new state of CAN_FLAG (SET or RESET).
  */
FlagStatus CAN_GetFlagStatus(CAN_TypeDef* CANx, uint32_t CAN_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  /* Check the parameters */
  assert_param(IS_CAN_ALL_PERIPH(CANx));
  assert_param(IS_CAN_GET_FLAG(CAN_FLAG));
  

